# интервал в секундах между проверками
daemon_b_s_sleep = 15
daemon_signals_sleep = 20
# задержка перед стартом
watchdog_delay = 10
# интервал проверки в минутах
watchdog_interval = 5

'''
стандартные значения при ошибке доступа в базу
'''
# минимальная сумма продажи
def_minimal_profit = 0.1
# размер лота, если не задано в БД
def_order_lot_price = 40
# минимальный баланс, если не задано в БД
def_minimum_balance = 60

'''
стандартные значения при ошибке доступа в базу
'''
# пауза в секундах между покупкой одной и той же акции
time_pause_buy = 60 * 30
# максимальное время для покупки лота в секундах. После этого лот будет отменен - средства разморожены.
max_time_to_buy = 60 * 30

'''
подсчет сигналов
'''
# за какой период в днях высчитывать сигнал на дневных свечах
signals_days_count = 60
# количество потоков для расчета сигналов
threads_count = 8

# Intraday section
# intraday время в минутах между двумя сигналами для одной акции
intraday_min = 30
# отправлять ли intraday сигналы в чат
send_intraday = True
